#include <iostream>
#include <utility>
#include "Cpmv.h"

int main()
{
    {
        std::cout << "\n======================================\n";
        Cpmv t1;                                                        //контсруктор по умолчанию
        t1.Display();
        std::cout << "\n======================================\n";
        Cpmv t2("test1", "test2");                                      //конструктор
        t2.Display();
        std::cout << "\n======================================\n";
        Cpmv t3(t2);                                                    //конструктор копирования
        t3.Display();
        std::cout << "\n======================================\n";
        Cpmv t4(std::move(t2));                                         //констркутор перемещения
        t4.Display();
        std::cout << "\n======================================\n";
        t1 = t3;                                                        //оператор присваивания с копированием
        t1.Display();
        std::cout << "\n======================================\n";
        Cpmv text("text1", "text2");    
        t1 = text + t3;                                                 //оператор присваивания с перемещением и оператор+
        t1.Display();
        std::cout << "\n======================================\n";
        return 0;
    }
}
